node {
  name: "Placeholder"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: -1
        }
        dim {
          size: -1
        }
        dim {
          size: 1
        }
      }
    }
  }
}
node {
  name: "Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_BOOL
        tensor_shape {
        }
        bool_val: false
      }
    }
  }
}
node {
  name: "moments/mean/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "moments/mean"
  op: "Mean"
  input: "Placeholder"
  input: "moments/mean/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: true
    }
  }
}
node {
  name: "moments/StopGradient"
  op: "StopGradient"
  input: "moments/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "moments/SquaredDifference"
  op: "SquaredDifference"
  input: "Placeholder"
  input: "moments/StopGradient"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "moments/variance/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "moments/variance"
  op: "Mean"
  input: "moments/SquaredDifference"
  input: "moments/variance/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: true
    }
  }
}
node {
  name: "batchnorm/add/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0010000000474974513
      }
    }
  }
}
node {
  name: "batchnorm/add"
  op: "Add"
  input: "moments/variance"
  input: "batchnorm/add/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "batchnorm/Rsqrt"
  op: "Rsqrt"
  input: "batchnorm/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "batchnorm/mul"
  op: "Mul"
  input: "Placeholder"
  input: "batchnorm/Rsqrt"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "batchnorm/Neg"
  op: "Neg"
  input: "moments/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "batchnorm/mul_1"
  op: "Mul"
  input: "batchnorm/Neg"
  input: "batchnorm/Rsqrt"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "batchnorm/add_1"
  op: "Add"
  input: "batchnorm/mul"
  input: "batchnorm/mul_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "MSDeepDet/Shape"
  op: "Shape"
  input: "Placeholder"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "MSDeepDet/strided_slice/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "MSDeepDet/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "MSDeepDet/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "MSDeepDet/strided_slice"
  op: "StridedSlice"
  input: "MSDeepDet/Shape"
  input: "MSDeepDet/strided_slice/stack"
  input: "MSDeepDet/strided_slice/stack_1"
  input: "MSDeepDet/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "MSDeepDet/Shape_1"
  op: "Shape"
  input: "Placeholder"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "MSDeepDet/strided_slice_1/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "MSDeepDet/strided_slice_1/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 2
      }
    }
  }
}
node {
  name: "MSDeepDet/strided_slice_1/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "MSDeepDet/strided_slice_1"
  op: "StridedSlice"
  input: "MSDeepDet/Shape_1"
  input: "MSDeepDet/strided_slice_1/stack"
  input: "MSDeepDet/strided_slice_1/stack_1"
  input: "MSDeepDet/strided_slice_1/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "MSDeepDet/Shape_2"
  op: "Shape"
  input: "Placeholder"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "MSDeepDet/strided_slice_2/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 2
      }
    }
  }
}
node {
  name: "MSDeepDet/strided_slice_2/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 3
      }
    }
  }
}
node {
  name: "MSDeepDet/strided_slice_2/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "MSDeepDet/strided_slice_2"
  op: "StridedSlice"
  input: "MSDeepDet/Shape_2"
  input: "MSDeepDet/strided_slice_2/stack"
  input: "MSDeepDet/strided_slice_2/stack_1"
  input: "MSDeepDet/strided_slice_2/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "MSDeepDet/ConvOnlyResNet/Identity"
  op: "Identity"
  input: "Placeholder"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "ConvOnlyResNet/init_conv/weights/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ConvOnlyResNet/init_conv/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\005\000\000\000\005\000\000\000\001\000\000\000\020\000\000\000"
      }
    }
  }
}
node {
  name: "ConvOnlyResNet/init_conv/weights/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ConvOnlyResNet/init_conv/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.11881770193576813
      }
    }
  }
}
node {
  name: "ConvOnlyResNet/init_conv/weights/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ConvOnlyResNet/init_conv/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.11881770193576813
      }
    }
  }
}
node {
  name: "ConvOnlyResNet/init_conv/weights/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "ConvOnlyResNet/init_conv/weights/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ConvOnlyResNet/init_conv/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "ConvOnlyResNet/init_conv/weights/Initializer/random_uniform/sub"
  op: "Sub"
  input: "ConvOnlyResNet/init_conv/weights/Initializer/random_uniform/max"
  input: "ConvOnlyResNet/init_conv/weights/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ConvOnlyResNet/init_conv/weights"
      }
    }
  }
}
node {
  name: "ConvOnlyResNet/init_conv/weights/Initializer/random_uniform/mul"
  op: "Mul"
  input: "ConvOnlyResNet/init_conv/weights/Initializer/random_uniform/RandomUniform"
  input: "ConvOnlyResNet/init_conv/weights/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ConvOnlyResNet/init_conv/weights"
      }
    }
  }
}
node {
  name: "ConvOnlyResNet/init_conv/weights/Initializer/random_uniform"
  op: "Add"
  input: "ConvOnlyResNet/init_conv/weights/Initializer/random_uniform/mul"
  input: "ConvOnlyResNet/init_conv/weights/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ConvOnlyResNet/init_conv/weights"
      }
    }
  }
}
node {
  name: "ConvOnlyResNet/init_conv/weights"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ConvOnlyResNet/init_conv/weights"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 5
        }
        dim {
          size: 5
        }
        dim {
          size: 1
        }
        dim {
          size: 16
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "ConvOnlyResNet/init_conv/weights/Assign"
  op: "Assign"
  input: "ConvOnlyResNet/init_conv/weights"
  input: "ConvOnlyResNet/init_conv/weights/Initializer/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ConvOnlyResNet/init_conv/weights"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "ConvOnlyResNet/init_conv/weights/read"
  op: "Identity"
  input: "ConvOnlyResNet/init_conv/weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ConvOnlyResNet/init_conv/weights"
      }
    }
  }
}
node {
  name: "ConvOnlyResNet/init_conv/biases/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ConvOnlyResNet/init_conv/biases"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 16
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "ConvOnlyResNet/init_conv/biases"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ConvOnlyResNet/init_conv/biases"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 16
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "ConvOnlyResNet/init_conv/biases/Assign"
  op: "Assign"
  input: "ConvOnlyResNet/init_conv/biases"
  input: "ConvOnlyResNet/init_conv/biases/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ConvOnlyResNet/init_conv/biases"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "ConvOnlyResNet/init_conv/biases/read"
  op: "Identity"
  input: "ConvOnlyResNet/init_conv/biases"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ConvOnlyResNet/init_conv/biases"
      }
    }
  }
}
node {
  name: "MSDeepDet/ConvOnlyResNet/init_conv/weights/tag"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "MSDeepDet/ConvOnlyResNet/init_conv/weights"
      }
    }
  }
}
node {
  name: "MSDeepDet/ConvOnlyResNet/init_conv/weights"
  op: "HistogramSummary"
  input: "MSDeepDet/ConvOnlyResNet/init_conv/weights/tag"
  input: "ConvOnlyResNet/init_conv/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "MSDeepDet/ConvOnlyResNet/init_conv/biases/tag"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "MSDeepDet/ConvOnlyResNet/init_conv/biases"
      }
    }
  }
}
node {
  name: "MSDeepDet/ConvOnlyResNet/init_conv/biases"
  op: "HistogramSummary"
  input: "MSDeepDet/ConvOnlyResNet/init_conv/biases/tag"
  input: "ConvOnlyResNet/init_conv/biases/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "MSDeepDet/ConvOnlyResNet/init_conv/Conv2D"
  op: "Conv2D"
  input: "MSDeepDet/ConvOnlyResNet/Identity"
  input: "ConvOnlyResNet/init_conv/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "MSDeepDet/ConvOnlyResNet/init_conv/BiasAdd"
  op: "BiasAdd"
  input: "MSDeepDet/ConvOnlyResNet/init_conv/Conv2D"
  input: "ConvOnlyResNet/init_conv/biases/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "ConvOnlyResNet/block-1/pre-bn/gamma/Initializer/ones"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ConvOnlyResNet/block-1/pre-bn/gamma"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 16
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "ConvOnlyResNet/block-1/pre-bn/gamma"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ConvOnlyResNet/block-1/pre-bn/gamma"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 16
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "ConvOnlyResNet/block-1/pre-bn/gamma/Assign"
  op: "Assign"
  input: "ConvOnlyResNet/block-1/pre-bn/gamma"
  input: "ConvOnlyResNet/block-1/pre-bn/gamma/Initializer/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ConvOnlyResNet/block-1/pre-bn/gamma"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "ConvOnlyResNet/block-1/pre-bn/gamma/read"
  op: "Identity"
  input: "ConvOnlyResNet/block-1/pre-bn/gamma"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ConvOnlyResNet/block-1/pre-bn/gamma"
      }
    }
  }
}
node {
  name: "ConvOnlyResNet/block-1/pre-bn/beta/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ConvOnlyResNet/block-1/pre-bn/beta"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 16
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "ConvOnlyResNet/block-1/pre-bn/beta"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ConvOnlyResNet/block-1/pre-bn/beta"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 16
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "ConvOnlyResNet/block-1/pre-bn/beta/Assign"
  op: "Assign"
  input: "ConvOnlyResNet/block-1/pre-bn/beta"
  input: "ConvOnlyResNet/block-1/pre-bn/beta/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ConvOnlyResNet/block-1/pre-bn/beta"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "ConvOnlyResNet/block-1/pre-bn/beta/read"
  op: "Identity"
  input: "ConvOnlyResNet/block-1/pre-bn/beta"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ConvOnlyResNet/block-1/pre-bn/beta"
      }
    }
  }
}
node {
  name: "ConvOnlyResNet/block-1/pre-bn/moving_mean/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ConvOnlyResNet/block-1/pre-bn/moving_mean"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 16
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "ConvOnlyResNet/block-1/pre-bn/moving_mean"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ConvOnlyResNet/block-1/pre-bn/moving_mean"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 16
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "ConvOnlyResNet/block-1/pre-bn/moving_mean/Assign"
  op: "Assign"
  input: "ConvOnlyResNet/block-1/pre-bn/moving_mean"
  input: "ConvOnlyResNet/block-1/pre-bn/moving_mean/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ConvOnlyResNet/block-1/pre-bn/moving_mean"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "ConvOnlyResNet/block-1/pre-bn/moving_mean/read"
  op: "Identity"
  input: "ConvOnlyResNet/block-1/pre-bn/moving_mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ConvOnlyResNet/block-1/pre-bn/moving_mean"
      }
    }
  }
}
node {
  name: "ConvOnlyResNet/block-1/pre-bn/moving_variance/Initializer/ones"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ConvOnlyResNet/block-1/pre-bn/moving_variance"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 16
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "ConvOnlyResNet/block-1/pre-bn/moving_variance"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ConvOnlyResNet/block-1/pre-bn/moving_variance"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 16
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "ConvOnlyResNet/block-1/pre-bn/moving_variance/Assign"
  op: "Assign"
  input: "ConvOnlyResNet/block-1/pre-bn/moving_variance"
  input: "ConvOnlyResNet/block-1/pre-bn/moving_variance/Initializer/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ConvOnlyResNet/block-1/pre-bn/moving_variance"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "ConvOnlyResNet/block-1/pre-bn/moving_variance/read"
  op: "Identity"
  input: "ConvOnlyResNet/block-1/pre-bn/moving_variance"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ConvOnlyResNet/block-1/pre-bn/moving_variance"
      }
    }
  }
}
node {
  name: "MSDeepDet/ConvOnlyResNet/block-1/pre-bn/FusedBatchNorm"
  op: "FusedBatchNorm"
  input: "MSDeepDet/ConvOnlyResNet/init_conv/BiasAdd"
  input: "ConvOnlyResNet/block-1/pre-bn/gamma/read"
  input: "ConvOnlyResNet/block-1/pre-bn/beta/read"
  input: "ConvOnlyResNet/block-1/pre-bn/moving_mean/read"
  input: "ConvOnlyResNet/block-1/pre-bn/moving_variance/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 1.0009999641624745e-05
    }
  }
  attr {
    key: "is_training"
    value {
      b: false
    }
  }
}
node {
  name: "MSDeepDet/ConvOnlyResNet/block-1/pre-bn/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.8999999761581421
      }
    }
  }
}
node {
  name: "MSDeepDet/ConvOnlyResNet/block-1/LeakyRelu/alpha"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.20000000298023224
      }
    }
  }
}
node {
  name: "MSDeepDet/ConvOnlyResNet/block-1/LeakyRelu/mul"
  op: "Mul"
  input: "MSDeepDet/ConvOnlyResNet/block-1/LeakyRelu/alpha"
  input: "MSDeepDet/ConvOnlyResNet/block-1/pre-bn/FusedBatchNorm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "MSDeepDet/ConvOnlyResNet/block-1/LeakyRelu/Maximum"
  op: "Maximum"
  input: "MSDeepDet/ConvOnlyResNet/block-1/LeakyRelu/mul"
  input: "MSDeepDet/ConvOnlyResNet/block-1/pre-bn/FusedBatchNorm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "ConvOnlyResNet/block-1/conv1/weights/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ConvOnlyResNet/block-1/conv1/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\005\000\000\000\005\000\000\000\020\000\000\000\020\000\000\000"
      }
    }
  }
}
node {
  name: "ConvOnlyResNet/block-1/conv1/weights/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ConvOnlyResNet/block-1/conv1/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.08660253882408142
      }
    }
  }
}
node {
  name: "ConvOnlyResNet/block-1/conv1/weights/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ConvOnlyResNet/block-1/conv1/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.08660253882408142
      }
    }
  }
}
node {
  name: "ConvOnlyResNet/block-1/conv1/weights/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "ConvOnlyResNet/block-1/conv1/weights/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ConvOnlyResNet/block-1/conv1/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "ConvOnlyResNet/block-1/conv1/weights/Initializer/random_uniform/sub"
  op: "Sub"
  input: "ConvOnlyResNet/block-1/conv1/weights/Initializer/random_uniform/max"
  input: "ConvOnlyResNet/block-1/conv1/weights/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ConvOnlyResNet/block-1/conv1/weights"
      }
    }
  }
}
node {
  name: "ConvOnlyResNet/block-1/conv1/weights/Initializer/random_uniform/mul"
  op: "Mul"
  input: "ConvOnlyResNet/block-1/conv1/weights/Initializer/random_uniform/RandomUniform"
  input: "ConvOnlyResNet/block-1/conv1/weights/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ConvOnlyResNet/block-1/conv1/weights"
      }
    }
  }
}
node {
  name: "ConvOnlyResNet/block-1/conv1/weights/Initializer/random_uniform"
  op: "Add"
  input: "ConvOnlyResNet/block-1/conv1/weights/Initializer/random_uniform/mul"
  input: "ConvOnlyResNet/block-1/conv1/weights/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ConvOnlyResNet/block-1/conv1/weights"
      }
    }
  }
}
node {
  name: "ConvOnlyResNet/block-1/conv1/weights"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ConvOnlyResNet/block-1/conv1/weights"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 5
        }
        dim {
          size: 5
        }
        dim {
          size: 16
        }
        dim {
          size: 16
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "ConvOnlyResNet/block-1/conv1/weights/Assign"
  op: "Assign"
  input: "ConvOnlyResNet/block-1/conv1/weights"
  input: "ConvOnlyResNet/block-1/conv1/weights/Initializer/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ConvOnlyResNet/block-1/conv1/weights"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "ConvOnlyResNet/block-1/conv1/weights/read"
  op: "Identity"
  input: "ConvOnlyResNet/block-1/conv1/weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ConvOnlyResNet/block-1/conv1/weights"
      }
    }
  }
}
node {
  name: "ConvOnlyResNet/block-1/conv1/biases/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ConvOnlyResNet/block-1/conv1/biases"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 16
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "ConvOnlyResNet/block-1/conv1/biases"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ConvOnlyResNet/block-1/conv1/biases"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 16
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "ConvOnlyResNet/block-1/conv1/biases/Assign"
  op: "Assign"
  input: "ConvOnlyResNet/block-1/conv1/biases"
  input: "ConvOnlyResNet/block-1/conv1/biases/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ConvOnlyResNet/block-1/conv1/biases"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "ConvOnlyResNet/block-1/conv1/biases/read"
  op: "Identity"
  input: "ConvOnlyResNet/block-1/conv1/biases"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ConvOnlyResNet/block-1/conv1/biases"
      }
    }
  }
}
node {
  name: "MSDeepDet/ConvOnlyResNet/block-1/conv1/weights/tag"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "MSDeepDet/ConvOnlyResNet/block-1/conv1/weights"
      }
    }
  }
}
node {
  name: "MSDeepDet/ConvOnlyResNet/block-1/conv1/weights"
  op: "HistogramSummary"
  input: "MSDeepDet/ConvOnlyResNet/block-1/conv1/weights/tag"
  input: "ConvOnlyResNet/block-1/conv1/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "MSDeepDet/ConvOnlyResNet/block-1/conv1/biases/tag"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "MSDeepDet/ConvOnlyResNet/block-1/conv1/biases"
      }
    }
  }
}
node {
  name: "MSDeepDet/ConvOnlyResNet/block-1/conv1/biases"
  op: "HistogramSummary"
  input: "MSDeepDet/ConvOnlyResNet/block-1/conv1/biases/tag"
  input: "ConvOnlyResNet/block-1/conv1/biases/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "MSDeepDet/ConvOnlyResNet/block-1/conv1/Conv2D"
  op: "Conv2D"
  input: "MSDeepDet/ConvOnlyResNet/block-1/LeakyRelu/Maximum"
  input: "ConvOnlyResNet/block-1/conv1/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "MSDeepDet/ConvOnlyResNet/block-1/conv1/BiasAdd"
  op: "BiasAdd"
  input: "MSDeepDet/ConvOnlyResNet/block-1/conv1/Conv2D"
  input: "ConvOnlyResNet/block-1/conv1/biases/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "ConvOnlyResNet/block-1/mid-bn/gamma/Initializer/ones"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ConvOnlyResNet/block-1/mid-bn/gamma"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 16
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "ConvOnlyResNet/block-1/mid-bn/gamma"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ConvOnlyResNet/block-1/mid-bn/gamma"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 16
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "ConvOnlyResNet/block-1/mid-bn/gamma/Assign"
  op: "Assign"
  input: "ConvOnlyResNet/block-1/mid-bn/gamma"
  input: "ConvOnlyResNet/block-1/mid-bn/gamma/Initializer/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ConvOnlyResNet/block-1/mid-bn/gamma"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "ConvOnlyResNet/block-1/mid-bn/gamma/read"
  op: "Identity"
  input: "ConvOnlyResNet/block-1/mid-bn/gamma"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ConvOnlyResNet/block-1/mid-bn/gamma"
      }
    }
  }
}
node {
  name: "ConvOnlyResNet/block-1/mid-bn/beta/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ConvOnlyResNet/block-1/mid-bn/beta"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 16
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "ConvOnlyResNet/block-1/mid-bn/beta"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ConvOnlyResNet/block-1/mid-bn/beta"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 16
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "ConvOnlyResNet/block-1/mid-bn/beta/Assign"
  op: "Assign"
  input: "ConvOnlyResNet/block-1/mid-bn/beta"
  input: "ConvOnlyResNet/block-1/mid-bn/beta/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ConvOnlyResNet/block-1/mid-bn/beta"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "ConvOnlyResNet/block-1/mid-bn/beta/read"
  op: "Identity"
  input: "ConvOnlyResNet/block-1/mid-bn/beta"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ConvOnlyResNet/block-1/mid-bn/beta"
      }
    }
  }
}
node {
  name: "ConvOnlyResNet/block-1/mid-bn/moving_mean/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ConvOnlyResNet/block-1/mid-bn/moving_mean"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 16
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "ConvOnlyResNet/block-1/mid-bn/moving_mean"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ConvOnlyResNet/block-1/mid-bn/moving_mean"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 16
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "ConvOnlyResNet/block-1/mid-bn/moving_mean/Assign"
  op: "Assign"
  input: "ConvOnlyResNet/block-1/mid-bn/moving_mean"
  input: "ConvOnlyResNet/block-1/mid-bn/moving_mean/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ConvOnlyResNet/block-1/mid-bn/moving_mean"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "ConvOnlyResNet/block-1/mid-bn/moving_mean/read"
  op: "Identity"
  input: "ConvOnlyResNet/block-1/mid-bn/moving_mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ConvOnlyResNet/block-1/mid-bn/moving_mean"
      }
    }
  }
}
node {
  name: "ConvOnlyResNet/block-1/mid-bn/moving_variance/Initializer/ones"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ConvOnlyResNet/block-1/mid-bn/moving_variance"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 16
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "ConvOnlyResNet/block-1/mid-bn/moving_variance"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ConvOnlyResNet/block-1/mid-bn/moving_variance"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 16
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "ConvOnlyResNet/block-1/mid-bn/moving_variance/Assign"
  op: "Assign"
  input: "ConvOnlyResNet/block-1/mid-bn/moving_variance"
  input: "ConvOnlyResNet/block-1/mid-bn/moving_variance/Initializer/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ConvOnlyResNet/block-1/mid-bn/moving_variance"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "ConvOnlyResNet/block-1/mid-bn/moving_variance/read"
  op: "Identity"
  input: "ConvOnlyResNet/block-1/mid-bn/moving_variance"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ConvOnlyResNet/block-1/mid-bn/moving_variance"
      }
    }
  }
}
node {
  name: "MSDeepDet/ConvOnlyResNet/block-1/mid-bn/FusedBatchNorm"
  op: "FusedBatchNorm"
  input: "MSDeepDet/ConvOnlyResNet/block-1/conv1/BiasAdd"
  input: "ConvOnlyResNet/block-1/mid-bn/gamma/read"
  input: "ConvOnlyResNet/block-1/mid-bn/beta/read"
  input: "ConvOnlyResNet/block-1/mid-bn/moving_mean/read"
  input: "ConvOnlyResNet/block-1/mid-bn/moving_variance/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 1.0009999641624745e-05
    }
  }
  attr {
    key: "is_training"
    value {
      b: false
    }
  }
}
node {
  name: "MSDeepDet/ConvOnlyResNet/block-1/mid-bn/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.8999999761581421
      }
    }
  }
}
node {
  name: "MSDeepDet/ConvOnlyResNet/block-1/LeakyRelu_1/alpha"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.20000000298023224
      }
    }
  }
}
node {
  name: "MSDeepDet/ConvOnlyResNet/block-1/LeakyRelu_1/mul"
  op: "Mul"
  input: "MSDeepDet/ConvOnlyResNet/block-1/LeakyRelu_1/alpha"
  input: "MSDeepDet/ConvOnlyResNet/block-1/mid-bn/FusedBatchNorm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "MSDeepDet/ConvOnlyResNet/block-1/LeakyRelu_1/Maximum"
  op: "Maximum"
  input: "MSDeepDet/ConvOnlyResNet/block-1/LeakyRelu_1/mul"
  input: "MSDeepDet/ConvOnlyResNet/block-1/mid-bn/FusedBatchNorm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "ConvOnlyResNet/block-1/conv2/weights/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ConvOnlyResNet/block-1/conv2/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\005\000\000\000\005\000\000\000\020\000\000\000\020\000\000\000"
      }
    }
  }
}
node {
  name: "ConvOnlyResNet/block-1/conv2/weights/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ConvOnlyResNet/block-1/conv2/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.08660253882408142
      }
    }
  }
}
node {
  name: "ConvOnlyResNet/block-1/conv2/weights/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ConvOnlyResNet/block-1/conv2/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.08660253882408142
      }
    }
  }
}
node {
  name: "ConvOnlyResNet/block-1/conv2/weights/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "ConvOnlyResNet/block-1/conv2/weights/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ConvOnlyResNet/block-1/conv2/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "ConvOnlyResNet/block-1/conv2/weights/Initializer/random_uniform/sub"
  op: "Sub"
  input: "ConvOnlyResNet/block-1/conv2/weights/Initializer/random_uniform/max"
  input: "ConvOnlyResNet/block-1/conv2/weights/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ConvOnlyResNet/block-1/conv2/weights"
      }
    }
  }
}
node {
  name: "ConvOnlyResNet/block-1/conv2/weights/Initializer/random_uniform/mul"
  op: "Mul"
  input: "ConvOnlyResNet/block-1/conv2/weights/Initializer/random_uniform/RandomUniform"
  input: "ConvOnlyResNet/block-1/conv2/weights/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ConvOnlyResNet/block-1/conv2/weights"
      }
    }
  }
}
node {
  name: "ConvOnlyResNet/block-1/conv2/weights/Initializer/random_uniform"
  op: "Add"
  input: "ConvOnlyResNet/block-1/conv2/weights/Initializer/random_uniform/mul"
  input: "ConvOnlyResNet/block-1/conv2/weights/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ConvOnlyResNet/block-1/conv2/weights"
      }
    }
  }
}
node {
  name: "ConvOnlyResNet/block-1/conv2/weights"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ConvOnlyResNet/block-1/conv2/weights"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 5
        }
        dim {
          size: 5
        }
        dim {
          size: 16
        }
        dim {
          size: 16
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "ConvOnlyResNet/block-1/conv2/weights/Assign"
  op: "Assign"
  input: "ConvOnlyResNet/block-1/conv2/weights"
  input: "ConvOnlyResNet/block-1/conv2/weights/Initializer/random_uniform"
  attr {
    key: "T"
    value {
